package practice;

public class course09 {
    public static void main(String[] args) {

    }
/*
        // 객체 지향

        // 절차지향
        1. 자판기에 돈을 넣는다
        2. 음료를 선택한다.
        3. 음료를 받는다
        4. 잔돈을 준다.
        == 시간순으로 프로그래밍
       객체 지향
       1. 자판기와 손님 객체를 만들어야한다
       2. 손님이 자판기에 돈을 넣는다.
       3. 자판기가 돈을 받는다.
       4. 손님이 원하는 음료를 선택한다
       5. 자판기는 음료를 준다
       6. 손님이 음료를 받는다
       7. 자판기는 계산해서 잔돈이 발생하면 거슬러준다.
       8. 손님은 잔돈을 받는다.
       == 객체간의 협력으로 프로그래밍

       클래스 : 객체를 만드는 설계도, 객체의 속성과 기능들이 정의되어있다.
       객체 : 클래스로 만들어진것

 */

}

